export const fetchItems = async () => {

    return new Promise(r => setTimeout(() => r([
        {
            "id": "5ec045dd5f4c99b1ff2b82f5",
            "mainImageUrlSuffix": "32x32",
            "name": "Colleen",
            "priceRange": [100, 5699],
            "description": "זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר "
        },
        {
            "id": "5ec045dd0e1772913300af98",
            "mainImageUrlSuffix": "32x32",
            "name": "Goff",
            "priceRange": [2367],
            "description": "זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר "
        },
        {
            "id": "5ec045dd2aead220e2909931",
            "mainImageUrlSuffix": "32x32",
            "name": "Hyde",
            "priceRange": [100, 4927],
            "description": "זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר "
        },
        {
            "id": "5ec045ddfb00dfc19b2560db",
            "mainImageUrlSuffix": "32x32",
            "name": "Merrill",
            "priceRange": [100, 2345],
            "description": "זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר "
        },
        {
            "id": "5ec045dd2fc9aae6abcfe308",
            "mainImageUrlSuffix": "32x32",
            "name": "Dickerson",
            "priceRange": [100, 6516],
            "description": "זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר "
        },
        {
            "id": "5ec045dda37abf036cfac861",
            "mainImageUrlSuffix": "32x32",
            "name": "Dora",
            "priceRange": [8432],
            "description": "זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר זהו טקסט שאמור להיות ממש ממש ארוך כל כך ארוך שזה נהייה ממש ממש ארוך כבר "
        }
    ]), 1200))
};
